In [41]:
import pandas as pd

datapath1 = "Resources/schools_complete.csv"
datapath2 = "Resources/students_complete.csv"

school_data = pd.read_csv(datapath1)
student_data = pd.read_csv(datapath2)
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [42]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [43]:
# data_file1["school_name"].value_counts(), to check if there is any repeat value
total_school = len(school_data["school_name"])
total_student = len(student_data["Student ID"])
# I did not use the student_name because there might be students share the same name,
# However, the student ID should be unique
total_budget = school_data["budget"].sum()
ave_math_score = student_data["math_score"].mean()
ave_reading_score = student_data["reading_score"].mean()

In [44]:
a = 0
for x in student_data["math_score"]:
    if x >= 70:
    # >=60 means pass or >=70 means pass?
        a += 1
math_passing_rate = a/len(student_data["math_score"])

In [45]:
b = 0
for x in student_data["reading_score"]:
    if x >= 70:
        b += 1
reading_passing_rate = b/len(student_data["reading_score"])

In [46]:
overall_passing_rate = (math_passing_rate + reading_passing_rate)/2

In [56]:
district_summary = [total_school]
district_summary = pd.DataFrame(district_summary, columns={"Total Schools"})
district_summary["Total Students"] = total_student
district_summary["Total Budget"] = total_budget
district_summary["Average Math Score"] = ave_math_score
district_summary["Average Reading Score"] = ave_reading_score
district_summary["% Passing Math"] = math_passing_rate*100
district_summary["% Passing Reading"] = reading_passing_rate*100
district_summary["Overall Passing Rate"] = overall_passing_rate*100
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.393158

In [64]:
new1 = school_data.groupby("school_name")
new2 = new1["school_name"].count()
new2 = pd.DataFrame(new2)
new2.head()

                      school_name
school_name
Bailey High School              1
Cabrera High School             1
Figueroa High School            1
Ford High School                1
Griffin High School             1

In [67]:
for i in new1["school_name"]:
    new2["type"] = new1.loc(i, new1["type"])

new2

AttributeError: Cannot access callable attribute 'loc' of 'DataFrameGroupBy' objects, try using the 'apply' method